src/InformationRegisters/КИИ_СерверMCPАудитВызовов/КИИ_СерверMCPАудитВызовов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_СерверMCPАудитВызовов</name>
  <comment>Audit log JSON-RPC вызовов MCP. Источник: КИИ_СерверMCPАудит.ЗаписатьВызов. Параллельно пишется в журнал регистрации.</comment>
  <resources>
    <name>Дата</name>
    <comment>UTC timestamp вызова MCP-сервиса.</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Вызывающий</name>
    <comment>Идентификатор клиента (имя пользователя Basic auth или IP/hostname).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <comment>Имя MCP-метода (tools/list, tools/call, ...).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХешПараметров</name>
    <comment>SHA-256 от каноничного JSON параметров (без secrets).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <comment>Статус: ok / error / partial.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDЗапроса</name>
    <comment>JSON-RPC id из payload (для корреляции с client-side логом).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрыСкрытые</name>
    <comment>JSON параметров вызова с замененными sensitive-значениями на &lt;redacted>. Дополнение к ХешПараметров для аналитики. Тип unlimited String — variable length, не упирается в SDBL row-size limit как fixed 2000.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <comment>UUID записи аудита (хранится как строка). Primary key.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/КИИ_СерверMCPАудит/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает событие аудита параллельно в журнал регистрации и регистр сведений.
//
// Параметры:
//  Вызывающий    - Строка - имя пользователя или IP/hostname
//  Метод         - Строка - MCP-метод или пустая строка для невалидного payload
//  ПараметрыJSON - Строка - сырой JSON-payload params для хеширования
//  Результат     - Строка - ok / error / auth_failed / rate_limited / parse_error
//  IDЗапроса     - Строка, Число, Неопределено - JSON-RPC id из payload
//
Процедура ЗаписатьВызов(Знач Вызывающий, Знач Метод, Знач ПараметрыJSON, Знач Результат, Знач IDЗапроса = "") Экспорт
	
	Попытка
		
		// Имена ключей совпадают с реквизитами регистра КИИ_СерверMCPАудитВызовов -
		// запись в регистр заполняется через ЗаполнитьЗначенияСвойств.
		ДанныеВызова = Новый Структура;
		ДанныеВызова.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор));
		ДанныеВызова.Вставить("Дата", ТекущаяУниверсальнаяДата());
		ДанныеВызова.Вставить("Вызывающий", ОбрезатьСтроку(Вызывающий, 100));
		ДанныеВызова.Вставить("Метод", ОбрезатьСтроку(Метод, 50));
		ДанныеВызова.Вставить("Результат", ОбрезатьСтроку(Результат, 20));
		ДанныеВызова.Вставить("ХешПараметров", ВычислитьХешПараметров(ПараметрыJSON));
		ДанныеВызова.Вставить("ПараметрыСкрытые", ВычислитьПараметрыСкрытые(ПараметрыJSON));
		ДанныеВызова.Вставить("IDЗапроса", ПолучитьIDЗапросаКакСтроку(IDЗапроса));
		
		ЗаписатьВЖурналРегистрации(ДанныеВызова);
		ЗаписатьВРегистрСведений(ДанныеВызова);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуАудита(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Извлекает идентификатор вызывающего из HTTPСервисЗапроса для audit caller.
//
// Параметры:
//  Запрос             - HTTPСервисЗапрос
//  ПользовательИзAuth - Строка - имя пользователя из ПроверитьBasicAuth
//
// Возвращаемое значение:
//  Строка
//
Функция ИзвлечьВызывающего(Знач Запрос, Знач ПользовательИзAuth) Экспорт
	
	Если ЗначениеЗаполнено(ПользовательИзAuth) Тогда
		Возврат ОбрезатьСтроку(ПользовательИзAuth, 100);
	КонецЕсли;
	
	АдресПрокси = СокрЛП(КИИ_СерверMCPAuth.ПолучитьЗаголовокЗапроса(Запрос.Заголовки, "X-Forwarded-For"));
	Если ЗначениеЗаполнено(АдресПрокси) Тогда
		Возврат ОбрезатьСтроку(АдресПрокси, 100);
	КонецЕсли;
	
	Возврат "anonymous";
	
КонецФункции

// Регламентная очистка аудита MCP: удаляет записи старше срока хранения.
// Вызывается заданием КИИ_СерверMCPАудитОчистка.
Процедура ВыполнитьОчисткуАудита() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	Попытка

		ПороговаяДата = НачалоДня(ТекущаяУниверсальнаяДата()) - СрокХраненияАудитаДней() * 86400;
		Удалено = ОчиститьЗаписиАудитаСтарше(ПороговаяДата);

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Очистка аудита MCP завершена. Удалено записей: %1'"), Удалено);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Аудит'"),
			УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);

	Исключение

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка очистки аудита MCP: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Аудит'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

	КонецПопытки;

КонецПроцедуры

// Удаляет записи аудита MCP старше пороговой даты (дата в регистре - UTC).
//
// Параметры:
//  ПороговаяДата - Дата - записи с датой вызова строго меньше пороговой удаляются.
//
// Возвращаемое значение:
//  Число - количество удаленных записей.
//
Функция ОчиститьЗаписиАудитаСтарше(Знач ПороговаяДата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аудит.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.КИИ_СерверMCPАудитВызовов КАК Аудит
	|ГДЕ
	|	Аудит.Дата < &ПороговаяДата";
	Запрос.УстановитьПараметр("ПороговаяДата", ПороговаяДата);

	Удалено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КИИ_СерверMCPАудитВызовов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
		НаборЗаписей.Записать();
		Удалено = Удалено + 1;
	КонецЦикла;

	Возврат Удалено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Срок хранения записей аудита MCP в днях; согласован со сроком хранения
// данных мониторинга по умолчанию.
Функция СрокХраненияАудитаДней()

	Возврат 30;

КонецФункции

Функция ВычислитьХешПараметров(Знач ПараметрыJSON)
	
	Если Не ЗначениеЗаполнено(ПараметрыJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Хешировщик = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хешировщик.Добавить(ПараметрыJSON);
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хешировщик.ХешСумма));
	
КонецФункции

Функция ВычислитьПараметрыСкрытые(Знач ПараметрыJSON)
	
	Если Не ЗначениеЗаполнено(ПараметрыJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Структура = ОбщегоНазначения.JSONВЗначение(ПараметрыJSON);
		Скрытые = КИИ_СерверMCPСокрытиеСекретов.СкрытьСекретыВПараметрах(Структура);
		Результат = ОбщегоНазначения.ЗначениеВJSON(Скрытые);
	Исключение
		Возврат "";
	КонецПопытки;
	
	Если СтрДлина(Результат) > 2000 Тогда
		Возврат Лев(Результат, 2000);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьIDЗапросаКакСтроку(Знач IDЗапроса)
	
	Если IDЗапроса = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ОбрезатьСтроку(Строка(IDЗапроса), 100);
	
КонецФункции

Функция ОбрезатьСтроку(Знач Значение, Знач МаксимальнаяДлина)
	
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗначениеСтрокой = Строка(Значение);
	
	Если СтрДлина(ЗначениеСтрокой) <= МаксимальнаяДлина Тогда
		Возврат ЗначениеСтрокой;
	КонецЕсли;
	
	Возврат Лев(ЗначениеСтрокой, МаксимальнаяДлина);
	
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(Знач ДанныеВызова)
	
	// Состав и порядок ключей сохраняются: JSON комментария журнала - внешний формат.
	ДанныеЛога = Новый Структура;
	ДанныеЛога.Вставить("Вызывающий", ДанныеВызова.Вызывающий);
	ДанныеЛога.Вставить("Метод", ДанныеВызова.Метод);
	ДанныеЛога.Вставить("ХешПараметров", ДанныеВызова.ХешПараметров);
	ДанныеЛога.Вставить("Результат", ДанныеВызова.Результат);
	ДанныеЛога.Вставить("IDЗапроса", ДанныеВызова.IDЗапроса);
	ДанныеЛога.Вставить("Идентификатор", ДанныеВызова.Идентификатор);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'КИИ.СерверMCP.Аудит'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.HTTPСервисы.КИИ_СерверMCPAPI,
		,
		ОбщегоНазначения.ЗначениеВJSON(ДанныеЛога));
	
КонецПроцедуры

Процедура ЗаписатьВРегистрСведений(Знач ДанныеВызова)
	
	МенеджерЗаписи = РегистрыСведений.КИИ_СерверMCPАудитВызовов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеВызова);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаписатьОшибкуАудита(Знач ТекстОшибкиАудита)

	// Аудит - вспомогательный тракт: его собственный сбой не должен ронять основной поток
	// обработки MCP-запроса, поэтому исключение здесь осознанно поглощается.
	// BSLLS:MissingCodeTryCatchEx-off
	Попытка

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка записи аудита MCP: %1'"),
			ТекстОшибкиАудита);
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.СерверMCP.Аудит'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.HTTPСервисы.КИИ_СерверMCPAPI,
			,
			ТекстОшибки);
		
	Исключение
	КонецПопытки;
	// BSLLS:MissingCodeTryCatchEx-on

КонецПроцедуры

#КонецОбласти
